Revit 2024 API
IFCLegacyStairOrRamp.GetBoundaryLines Method
 Gets boundary lines.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public IList<CurveLoop> GetBoundaryLines()
Visual Basic
Public Function GetBoundaryLines As IList(Of CurveLoop)
Visual C++
public:
IList<CurveLoop^>^ GetBoundaryLines()
Return Value
 The boundary lines.
See Also
IFCLegacyStairOrRamp Class
Autodesk.Revit.DB.IFC Namespace